
## 📋 Terraform Plan Summary

**Plan Type:** apply
**Environment:** staging
**Trigger:** pull_request

### Changes Overview
- 🟢 **Resources to add:** 21
- 🟡 **Resources to change:** 0
0  
- 🔴 **Resources to destroy:** 0
0

### Plan Status
✅ **No changes** - Infrastructure is up to date


### 🔒 Security Analysis

✅ Sensitive values are properly marked
✅ No hardcoded secrets detected


### 💰 Estimated Monthly Costs

> **Note:** These are rough estimates. Actual costs depend on usage patterns.

| Resource | Estimated Cost |
|----------|----------------|
| Lambda Function | $0-5 (depends on invocations) |
| API Gateway | $0-10 (depends on requests) |
| ECR Repository | $0-1 (storage) |
| CloudWatch Logs | $0-2 (log retention) |

**Total Estimated Range:** $0-18/month

💡 **Cost Optimization Tips:**
- Lambda costs are based on execution time and memory
- API Gateway charges per request
- Consider setting up CloudWatch cost alerts



<details>
<summary>📋 Full Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.api_cert[0] will be created
  + resource "aws_acm_certificate" "api_cert" {
      + arn                       = (known after apply)
      + domain_name               = "dev.ai-ip.chrismarasco.io"
      + domain_validation_options = [
          + {
              + domain_name           = "dev.ai-ip.chrismarasco.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + region                    = "us-east-1"
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "dev.ai-ip.chrismarasco.io",
        ]
      + tags                      = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }
      + tags_all                  = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.api_cert[0] will be created
  + resource "aws_acm_certificate_validation" "api_cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + region                  = "us-east-1"
      + validation_record_fqdns = (known after apply)
    }

  # aws_apigatewayv2_api.api_gw will be created
  + resource "aws_apigatewayv2_api" "api_gw" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "ai-interview-prep-development-api"
      + protocol_type                = "HTTP"
      + region                       = "us-east-1"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }
      + tags_all                     = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }

      + cors_configuration {
          + allow_credentials = false
          + allow_headers     = [
              + "authorization",
              + "content-type",
              + "x-amz-date",
              + "x-api-key",
            ]
          + allow_methods     = [
              + "*",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 300
        }
    }

  # aws_apigatewayv2_api_mapping.api_mapping[0] will be created
  + resource "aws_apigatewayv2_api_mapping" "api_mapping" {
      + api_id      = (known after apply)
      + domain_name = (known after apply)
      + id          = (known after apply)
      + region      = "us-east-1"
      + stage       = (known after apply)
    }

  # aws_apigatewayv2_domain_name.api_domain[0] will be created
  + resource "aws_apigatewayv2_domain_name" "api_domain" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "dev.ai-ip.chrismarasco.io"
      + id                               = (known after apply)
      + region                           = "us-east-1"
      + tags                             = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }
      + tags_all                         = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }

      + domain_name_configuration {
          + certificate_arn                        = (known after apply)
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ip_address_type                        = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # aws_apigatewayv2_integration.lambda_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + region                                    = "us-east-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.api_route will be created
  + resource "aws_apigatewayv2_route" "api_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-1"
      + route_key          = "POST /"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.api_stage will be created
  + resource "aws_apigatewayv2_stage" "api_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + region        = "us-east-1"
      + tags_all      = (known after apply)
    }

  # aws_cloudwatch_log_group.lambda_logs will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/ai-interview-prep-development"
      + name_prefix       = (known after apply)
      + region            = "us-east-1"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }
      + tags_all          = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }
    }

  # aws_ecr_repository.lambda_repo will be created
  + resource "aws_ecr_repository" "lambda_repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ai-interview-prep-development"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }
      + tags_all             = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }
    }

  # aws_iam_openid_connect_provider.github will be created
  + resource "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
          + "Name"        = "github-actions-oidc"
        }
      + tags_all        = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
          + "Name"        = "github-actions-oidc"
        }
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_policy.github_actions_policy will be created
  + resource "aws_iam_policy" "github_actions_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for GitHub Actions to deploy infrastructure and applications"
      + id               = (known after apply)
      + name             = "ai-interview-prep-development-github-actions-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchImportImage",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:PutImage",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeRepositories",
                          + "ecr:CreateRepository",
                          + "ecr:DeleteRepository",
                          + "ecr:SetRepositoryPolicy",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListTagsForResource",
                          + "ecr:TagResource",
                          + "ecr:UntagResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "lambda:UpdateFunctionCode",
                          + "lambda:UpdateFunctionConfiguration",
                          + "lambda:GetFunction",
                          + "lambda:GetFunctionConfiguration",
                          + "lambda:PublishVersion",
                          + "lambda:CreateFunction",
                          + "lambda:DeleteFunction",
                          + "lambda:AddPermission",
                          + "lambda:RemovePermission",
                          + "lambda:ListTags",
                          + "lambda:TagResource",
                          + "lambda:UntagResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:DeleteLogGroup",
                          + "logs:DeleteLogStream",
                          + "logs:PutRetentionPolicy",
                          + "logs:ListTagsLogGroup",
                          + "logs:TagLogGroup",
                          + "logs:UntagLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                          + "s3:ListBucket",
                          + "s3:CreateBucket",
                          + "s3:DeleteBucket",
                          + "s3:GetBucketLocation",
                          + "s3:GetBucketVersioning",
                          + "s3:PutBucketVersioning",
                          + "s3:GetBucketWebsite",
                          + "s3:PutBucketWebsite",
                          + "s3:DeleteBucketWebsite",
                          + "s3:GetBucketPolicy",
                          + "s3:PutBucketPolicy",
                          + "s3:DeleteBucketPolicy",
                          + "s3:GetBucketTagging",
                          + "s3:PutBucketTagging",
                          + "s3:GetBucketPublicAccessBlock",
                          + "s3:PutBucketPublicAccessBlock",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::ai-interview-prep-development-frontend",
                          + "arn:aws:s3:::ai-interview-prep-development-frontend/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "cloudfront:CreateInvalidation",
                          + "cloudfront:GetInvalidation",
                          + "cloudfront:ListInvalidations",
                          + "cloudfront:CreateDistribution",
                          + "cloudfront:GetDistribution",
                          + "cloudfront:GetDistributionConfig",
                          + "cloudfront:UpdateDistribution",
                          + "cloudfront:DeleteDistribution",
                          + "cloudfront:ListDistributions",
                          + "cloudfront:TagResource",
                          + "cloudfront:UntagResource",
                          + "cloudfront:ListTagsForResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:GetHostedZone",
                          + "route53:ChangeResourceRecordSets",
                          + "route53:GetChange",
                          + "route53:ListResourceRecordSets",
                          + "route53:ListTagsForResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "acm:RequestCertificate",
                          + "acm:AddTagsToCertificate",
                          + "acm:ListTagsForCertificate",
                          + "acm:RemoveTagsFromCertificate",
                          + "acm:DeleteCertificate",
                          + "acm:GetCertificate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:CreateRole",
                          + "iam:DeleteRole",
                          + "iam:GetRole",
                          + "iam:UpdateRole",
                          + "iam:PassRole",
                          + "iam:CreatePolicy",
                          + "iam:DeletePolicy",
                          + "iam:GetPolicy",
                          + "iam:GetPolicyVersion",
                          + "iam:ListPolicyVersions",
                          + "iam:AttachRolePolicy",
                          + "iam:DetachRolePolicy",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:GetRolePolicy",
                          + "iam:ListRolePolicies",
                          + "iam:TagRole",
                          + "iam:UntagRole",
                          + "iam:ListRoleTags",
                          + "iam:TagPolicy",
                          + "iam:UntagPolicy",
                          + "iam:ListPolicyTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "apigateway:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sts:GetCallerIdentity",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
          + "Name"        = "ai-interview-prep-development-github-actions-policy"
        }
      + tags_all         = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
          + "Name"        = "ai-interview-prep-development-github-actions-policy"
        }
    }

  # aws_iam_policy.lambda_policy will be created
  + resource "aws_iam_policy" "lambda_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ai-interview-prep-development-lambda-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.github_actions will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ai-interview-prep-development-github-actions"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
          + "Name"        = "ai-interview-prep-development-github-actions"
        }
      + tags_all              = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
          + "Name"        = "ai-interview-prep-development-github-actions"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ai-interview-prep-development-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.github_actions_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "github_actions_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ai-interview-prep-development-github-actions"
    }

  # aws_iam_role_policy_attachment.lambda_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ai-interview-prep-development-lambda-role"
    }

  # aws_lambda_function.ai_handler will be created
  + resource "aws_lambda_function" "ai_handler" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "ai-interview-prep-development"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }
      + tags_all                       = {
          + "Application" = "ai-interview-prep"
          + "Environment" = "development"
        }
      + timeout                        = 120
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DEBUG"          = "true"
              + "ENVIRONMENT"    = "development"
              + "OPENAI_API_KEY" = (sensitive value)
            }
        }
    }

  # aws_lambda_permission.allow_api_gateway will be created
  + resource "aws_lambda_permission" "allow_api_gateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ai-interview-prep-development"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_route53_record.api_record[0] will be created
  + resource "aws_route53_record" "api_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev.ai-ip.chrismarasco.io"
      + type            = "A"
      + zone_id         = "Z09619741MD1JY4BVC74L"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.cert_validation["dev.ai-ip.chrismarasco.io"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z09619741MD1JY4BVC74L"
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_url          = (known after apply)
  + custom_domain_url        = "https://dev.ai-ip.chrismarasco.io"
  + full_domain              = "dev.ai-ip.chrismarasco.io"
  + github_actions_role_arn  = (known after apply)
  + github_oidc_provider_arn = (known after apply)

```

</details>

---

**Workflow:** [Terraform Plan (Dry Run)](https://github.com/cxm6467/ai-interview-prep/actions/runs/17182191589)
**Commit:** 1a13837
